---
kind: type
id: T:Autodesk.Revit.DB.InsertableObject
source: html/73d870e0-a408-719c-58bd-1fb2ab8f9e5b.htm
---
# Autodesk.Revit.DB.InsertableObject

A base class you all types that are insertable.

## Syntax (C#)
```csharp
public class InsertableObject : ElementType
```